---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExportLinetypeTableIterator
source: html/2e96602f-4c35-898c-0854-3298a231ac55.htm
---
# ExportLinetypeTableIterator Methods

Identifies if the iteration has completed.